<a href="https://colab.research.google.com/github/Mrcwr2/Python_Excel_Clean_Data/blob/main/7_End__Replace_dataframe_values.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Replace dataframe values
---

## **Excel:**

*   Ribbon: Home -> Find & Select

![replace-values.png]()

## **Python:**



*   Use .replace(what_to_replace, what_to_replace_it_with)


    df.replace('old_value', 'new_value')

<br>

### Load required packages and data
---

In [ ]:
# Import required packages
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
# Save Github location paths to a variable
failed_bank_path = 'https://github.com/The-Calculated-Life/python_analysis_for_excel/blob/main/data/failed_banks.xlsx?raw=true'
bx_books_path = 'https://raw.githubusercontent.com/The-Calculated-Life/python_analysis_for_excel/main/data/bx_books.csv'

# Read excel and CSV files
bank_detail = pd.read_excel(failed_bank_path, sheet_name='detail')
bx_books = pd.read_csv(bx_books_path)

# Changes for demo
bank_detail.iloc[[0, 2, 574, 578], :] = bank_detail.iloc[[0, 2, 574, 578], :].replace('FAILURE', 'FIALURE')
bx_books[bx_books['book_author'] == 'J.K. Rowling'] = bx_books[bx_books['book_author'] == 'J.K. Rowling'].replace('J.K. Rowling', 'JK Rowling')

<br>

### Example: Replace a value
---

In [ ]:
# Review bank_detail dataframe for errors
bank_detail.head()

    CERT      FIN     CHARTER  ESTIMATED LOSS  ASSETS  DEPOSITS RESOLUTION
0  14361  10536.0  COMMERCIAL             NaN  152400    139526    FIALURE
1  18265  10535.0  COMMERCIAL             NaN  100879     95159    FAILURE
2  21111  10534.0  COMMERCIAL          2491.0  120574    111234    FIALURE
3  58112  10532.0  COMMERCIAL          4547.0   29726     26473    FAILURE
4  58317  10533.0       OTHER          2188.0   27119     26151    FAILURE

<br>

In [ ]:
# Fix the text issues using .replace()
bank_detail.replace('FIALURE', 'FAILURE')

      CERT      FIN     CHARTER  ESTIMATED LOSS  ASSETS  DEPOSITS RESOLUTION
0    14361  10536.0  COMMERCIAL             NaN  152400    139526    FAILURE
1    18265  10535.0  COMMERCIAL             NaN  100879     95159    FAILURE
2    21111  10534.0  COMMERCIAL          2491.0  120574    111234    FAILURE
3    58112  10532.0  COMMERCIAL          4547.0   29726     26473    FAILURE
4    58317  10533.0       OTHER          2188.0   27119     26151    FAILURE
..     ...      ...         ...             ...     ...       ...        ...
574    338   4644.0  COMMERCIAL         14592.0   85485     77140    FAILURE
575  10985   4643.0  COMMERCIAL          1363.0   25942     26667    FAILURE
576  25056   4642.0  COMMERCIAL           617.0    7923      7680    FAILURE
577  27886   6003.0       OTHER          1322.0   31479     32234    FAILURE
578  14228   4641.0  COMMERCIAL         11574.0  105044     68549    FAILURE

[579 rows x 7 columns]

<br>

In [ ]:
# Save the text issue fix in the original dataframe 
bank_detail = bank_detail.replace('FIALURE', 'FAILURE')

<br>

<br><br>
##### **QUICK CHALLENGE #1: Practice replacing data**

You notice that the periods are missing from author J.K. Rowling in the `book_author` column.

**Task: Correct the error and replace "JK Rowling" with "J.K. Rowling" in the `book_author` column**

In [ ]:
# Your code for quick challenge #1 here:
bx_books = bx_books.replace('JK Rowling', 'J.K. Rowling')

In [ ]:
bx_books[bx_books['book_author'] == 'JK Rowling']

Empty DataFrame
Columns: [isbn, book_title, book_author, year_of_publication, publisher]
Index: []

In [ ]:
/